using System;
using System.Collections.Generic;
using System.Globalization;
using System.Linq;
using System.Windows.Forms;

namespace VolumeConverter
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }

        private void textBox1_TextChanged(object sender, EventArgs e)
        {
            if ((textBox1.Text.Length > 0)
                && textBox1.Text[textBox1.Text.Length - 1] != '.'
                && listBox1.SelectedItem != null 
                && listBox2.SelectedItem != null)
                textBox2.Text = Convert(listBox1.SelectedItem.ToString(),
                    listBox2.SelectedItem.ToString());
        }

        private void listBox1_SelectedIndexChanged(object sender, EventArgs e)
        {
            if(listBox2.SelectedItem != null)
            {
                textBox2.Text = Convert(listBox1.SelectedItem.ToString(),
                    listBox2.SelectedItem.ToString());
            }
        }

        private void listBox2_SelectedIndexChanged(object sender, EventArgs e)
        {
            if (listBox1.SelectedItem != null)
            {
                textBox2.Text = Convert(listBox1.SelectedItem.ToString(),
                    listBox2.SelectedItem.ToString());
            }
        }

        private void textBox1_KeyPress(object sender, KeyPressEventArgs e)
        {
            if (e.KeyChar == '.' && textBox1.Text.Contains('.'))
            {
                e.Handled = true;
            }
            else if (!Char.IsDigit(e.KeyChar) && !Char.IsControl(e.KeyChar) && !(e.KeyChar == '.'))
            {
                e.Handled = true;
            }
        }

        private string Convert(string convertionFrom, string convertionTo)
        {
            string text = textBox1.Text;
            if(double.TryParse(text, NumberStyles.Number, CultureInfo.CreateSpecificCulture("en-US"), out double number)) 
            {
                if(ConvertionRate.TryGetValue((convertionFrom, convertionTo),out double rate))
                {
                    double result = rate * number;
                    return result.ToString();
                }
                return number.ToString();   
            }
            return "0";
        }

        private static readonly Dictionary<(string, string), double> ConvertionRate
        = new Dictionary<(string, string), double>
        {
            { ("мм³", "м³"), 0.000000001 },
            { ("мм³", "дм³"), 0.000001 },
            { ("мм³", "см³"), 0.001 },
            { ("мм³", "Литр"), 0.000001 },
            { ("мм³", "Миллилитр"), 0.001 },
            { ("мм³", "Американская жидкая унция"), 0.00003381 },
            { ("мм³", "Американский галлон"), 0.0000002642 },
            { ("мм³", "Британская жидкая унция"), 0.0000352 },
            { ("мм³", "Британский галлон"), 0.00000022 },

            { ("см³", "м³"), 0.000001 },
            { ("см³", "дм³"), 0.001 },
            { ("см³", "мм³"), 1000 },
            { ("см³", "Литр"), 0.001 },
            { ("см³", "Миллилитр"), 1 },
            { ("см³", "Американская жидкая унция"), 0.03381 },
            { ("см³", "Американский галлон"), 0.0002642 },
            { ("см³", "Британская жидкая унция"), 0.0352 },
            { ("см³", "Британский галлон"), 0.00022 },

            { ("дм³", "м³"), 0.001 },
            { ("дм³", "мм³"), 1_000_000 },
            { ("дм³", "см³"), 1000 },
            { ("дм³", "Литр"), 1 },
            { ("дм³", "Миллилитр"), 1000 },
            { ("дм³", "Американская жидкая унция"), 33.81 },
            { ("дм³", "Американский галлон"), 0.2642 },
            { ("дм³", "Британская жидкая унция"), 35.2 },
            { ("дм³", "Британский галлон"), 0.22 },

            { ("м³", "мм³"), 1_000_000_000 },
            { ("м³", "дм³"), 1000 },
            { ("м³", "см³"), 1_000_000 },
            { ("м³", "Литр"), 1000 },
            { ("м³", "Миллилитр"), 1_000_000 },
            { ("м³", "Американская жидкая унция"), 33814 },
            { ("м³", "Американский галлон"), 264.2 },
            { ("м³", "Британская жидкая унция"), 35195 },
            { ("м³", "Британский галлон"), 220 },

            { ("Литр", "м³"), 0.001 },
            { ("Литр", "дм³"), 1 },
            { ("Литр", "см³"), 1000 },
            { ("Литр", "мм³"), 1_000_000 },
            { ("Литр", "Миллилитр"), 1000 },
            { ("Литр", "Американская жидкая унция"), 33.81 },
            { ("Литр", "Американский галлон"), 0.2642 },
            { ("Литр", "Британская жидкая унция"), 35.2 },
            { ("Литр", "Британский галлон"), 0.22 },

            { ("Миллилитр", "м³"), 0.000001 },
            { ("Миллилитр", "дм³"), 0.001 },
            { ("Миллилитр", "см³"), 1 },
            { ("Миллилитр", "мм³"), 1000 },
            { ("Миллилитр", "Литр"), 0.001 },
            { ("Миллилитр", "Американская жидкая унция"), 0.03381 },
            { ("Миллилитр", "Американский галлон"), 0.0002642 },
            { ("Миллилитр", "Британская жидкая унция"), 0.0352 },
            { ("Миллилитр", "Британский галлон"), 0.00022 },

            { ("Американская жидкая унция", "м³"), 0.00002957 },
            { ("Американская жидкая унция", "дм³"), 0.02957 },
            { ("Американская жидкая унция", "см³"), 29.57 },
            { ("Американская жидкая унция", "мм³"), 29574 },
            { ("Американская жидкая унция", "Литр"), 0.02957 },
            { ("Американская жидкая унция", "Миллилитр"), 29.57 },
            { ("Американская жидкая унция", "Американский галлон"), 0.007813 },
            { ("Американская жидкая унция", "Британская жидкая унция"), 1.041 },
            { ("Американская жидкая унция", "Британский галлон"), 0.006505 },

            { ("Американский галлон", "м³"), 0.003785 },
            { ("Американский галлон", "дм³"), 3.785 },
            { ("Американский галлон", "см³"), 3785 },
            { ("Американский галлон", "мм³"), 3_785_412 },
            { ("Американский галлон", "Литр"), 3.785 },
            { ("Американский галлон", "Миллилитр"), 3785 },
            { ("Американский галлон", "Американская жидкая унция"), 128 },
            { ("Американский галлон", "Британская жидкая унция"), 133.2 },
            { ("Американский галлон", "Британский галлон"), 0.8327 },

            { ("Британский галлон", "м³"), 0.004546 },
            { ("Британский галлон", "дм³"), 4.546 },
            { ("Британский галлон", "см³"), 4546 },
            { ("Британский галлон", "мм³"), 4_546_090 },
            { ("Британский галлон", "Литр"), 4.546 },
            { ("Британский галлон", "Миллилитр"), 4546 },
            { ("Британский галлон", "Американская жидкая унция"), 153.7 },
            { ("Британский галлон", "Британская жидкая унция"), 160 },
            { ("Британский галлон", "Американский галлон"), 1.201 },

            { ("Британская жидкая унция", "м³"), 0.00002841 },
            { ("Британская жидкая унция", "дм³"), 0.02841 },
            { ("Британская жидкая унция", "см³"), 28.41 },
            { ("Британская жидкая унция", "мм³"), 2841 },
            { ("Британская жидкая унция", "Литр"), 0.2841 },
            { ("Британская жидкая унция", "Миллилитр"), 28.41 },
            { ("Британская жидкая унция", "Американский галлон"), 0.007506 },
            { ("Британская жидкая унция", "Американская жидкая унция"), 0.9608 },
            { ("Британская жидкая унция", "Британский галлон"), 0.00625 },
        };
    }
}
